personal-note-sangjoon/loadtest/tsung1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

<!-- run "tsung -f test.xml -k start" on command line and open http://localhost:8091 -->


<clients>
 <client host="localhost" use_controller_vm="true" maxusers="15000"/>
 </clients>
 <servers>
 <server host="localhost:3000" port="80" type="tcp"/>
 </servers>

 <load>
 <arrivalphase phase="1" duration="10" unit="second">
 <users arrivalrate="1" unit="second" />
 </arrivalphase>
 <arrivalphase phase="2" duration="10" unit="second">
 <users arrivalrate="2" unit="second" />
 </arrivalphase>
 <arrivalphase phase="3" duration="10" unit="second">
 <users arrivalrate="4" unit="second" />
 </arrivalphase>
 <arrivalphase phase="4" duration="10" unit="second">
 <users arrivalrate="8" unit="second" />
 </arrivalphase>
 </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->
<sessions>
 <session name="http-example" probability="100" type="ts_http">
 <request>
 <http url="/app/view" version="1.1" method="GET"/>
 </request>
 </session>
 </sessions>

</tsung>